nxp-mcuxpresso/mcux-sdk/devices/LPC55S14/LPC55S14.h
#define FLASH_NMPA_PUF_SRAM_WAEN_MASK            (0x400000U)
#define FLASH_NMPA_PUF_SRAM_WAEN_SHIFT           (22U)
/*! WAEN - SRAM Write Assist Enable
 */
#define FLASH_NMPA_PUF_SRAM_WAEN(x)              (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_WAEN_SHIFT)) & FLASH_NMPA_PUF_SRAM_WAEN_MASK)

#define FLASH_NMPA_PUF_SRAM_WAM_MASK             (0x1800000U)
#define FLASH_NMPA_PUF_SRAM_WAM_SHIFT            (23U)
/*! WAM - SRAM Write Assist settings
 */
#define FLASH_NMPA_PUF_SRAM_WAM(x)               (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_WAM_SHIFT)) & FLASH_NMPA_PUF_SRAM_WAM_MASK)

#define FLASH_NMPA_PUF_SRAM_STBP_MASK            (0x2000000U)
#define FLASH_NMPA_PUF_SRAM_STBP_SHIFT           (25U)
/*! STBP - STBP
 */
#define FLASH_NMPA_PUF_SRAM_STBP(x)              (((uint32_t)(((uint32_t)(x)) << FLASH_NMPA_PUF_SRAM_STBP_SHIFT)) & FLASH_NMPA_PUF_SRAM_STBP_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group FLASH_NMPA_Register_Masks */


/* FLASH_NMPA - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral FLASH_NMPA base address */
  #define FLASH_NMPA_BASE                          (0x1003FC00u)
  /** Peripheral FLASH_NMPA base address */
  #define FLASH_NMPA_BASE_NS                       (0x3FC00u)
  /** Peripheral FLASH_NMPA base pointer */
  #define FLASH_NMPA                               ((FLASH_NMPA_Type *)FLASH_NMPA_BASE)
  /** Peripheral FLASH_NMPA base pointer */
  #define FLASH_NMPA_NS                            ((FLASH_NMPA_Type *)FLASH_NMPA_BASE_NS)
  /** Array initializer of FLASH_NMPA peripheral base addresses */
  #define FLASH_NMPA_BASE_ADDRS                    { FLASH_NMPA_BASE }
  /** Array initializer of FLASH_NMPA peripheral base pointers */
  #define FLASH_NMPA_BASE_PTRS                     { FLASH_NMPA }
  /** Array initializer of FLASH_NMPA peripheral base addresses */
  #define FLASH_NMPA_BASE_ADDRS_NS                 { FLASH_NMPA_BASE_NS }
  /** Array initializer of FLASH_NMPA peripheral base pointers */
  #define FLASH_NMPA_BASE_PTRS_NS                  { FLASH_NMPA_NS }
#else
  /** Peripheral FLASH_NMPA base address */
  #define FLASH_NMPA_BASE                          (0x3FC00u)
  /** Peripheral FLASH_NMPA base pointer */
  #define FLASH_NMPA                               ((FLASH_NMPA_Type *)FLASH_NMPA_BASE)
  /** Array initializer of FLASH_NMPA peripheral base addresses */
  #define FLASH_NMPA_BASE_ADDRS                    { FLASH_NMPA_BASE }
  /** Array initializer of FLASH_NMPA peripheral base pointers */
  #define FLASH_NMPA_BASE_PTRS                     { FLASH_NMPA }
#endif

/*!
 * @}
 */ /* end of group FLASH_NMPA_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- FLASH_ROMPATCH Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLASH_ROMPATCH_Peripheral_Access_Layer FLASH_ROMPATCH Peripheral Access Layer
 * @{
 */

/** FLASH_ROMPATCH - Register Layout Typedef */
typedef struct {
  __IO uint32_t HEADER;                            /**< ., offset: 0x0 */
  __IO uint32_t PATCH[255];                        /**< ., array offset: 0x4, array step: 0x4 */
} FLASH_ROMPATCH_Type;

/* ----------------------------------------------------------------------------
   -- FLASH_ROMPATCH Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLASH_ROMPATCH_Register_Masks FLASH_ROMPATCH Register Masks
 * @{
 */

/*! @name HEADER - . */
/*! @{ */

#define FLASH_ROMPATCH_HEADER_ENTRIES_MASK       (0xFFU)
#define FLASH_ROMPATCH_HEADER_ENTRIES_SHIFT      (0U)
/*! ENTRIES - .
 */
#define FLASH_ROMPATCH_HEADER_ENTRIES(x)         (((uint32_t)(((uint32_t)(x)) << FLASH_ROMPATCH_HEADER_ENTRIES_SHIFT)) & FLASH_ROMPATCH_HEADER_ENTRIES_MASK)

#define FLASH_ROMPATCH_HEADER_SUB_TYPE_MASK      (0xFF00U)
#define FLASH_ROMPATCH_HEADER_SUB_TYPE_SHIFT     (8U)
/*! SUB_TYPE - .
 */
#define FLASH_ROMPATCH_HEADER_SUB_TYPE(x)        (((uint32_t)(((uint32_t)(x)) << FLASH_ROMPATCH_HEADER_SUB_TYPE_SHIFT)) & FLASH_ROMPATCH_HEADER_SUB_TYPE_MASK)

#define FLASH_ROMPATCH_HEADER_TYPE_MASK          (0xFF0000U)
#define FLASH_ROMPATCH_HEADER_TYPE_SHIFT         (16U)
/*! TYPE - .
 */
#define FLASH_ROMPATCH_HEADER_TYPE(x)            (((uint32_t)(((uint32_t)(x)) << FLASH_ROMPATCH_HEADER_TYPE_SHIFT)) & FLASH_ROMPATCH_HEADER_TYPE_MASK)

#define FLASH_ROMPATCH_HEADER_IDENTIFIER_MASK    (0xFF000000U)
#define FLASH_ROMPATCH_HEADER_IDENTIFIER_SHIFT   (24U)
/*! IDENTIFIER - .
 */
#define FLASH_ROMPATCH_HEADER_IDENTIFIER(x)      (((uint32_t)(((uint32_t)(x)) << FLASH_ROMPATCH_HEADER_IDENTIFIER_SHIFT)) & FLASH_ROMPATCH_HEADER_IDENTIFIER_MASK)
/*! @} */

/*! @name PATCH - . */
/*! @{ */

#define FLASH_ROMPATCH_PATCH_PATCH_MASK          (0xFFFFFFFFU)
#define FLASH_ROMPATCH_PATCH_PATCH_SHIFT         (0U)
/*! PATCH - .
 */
#define FLASH_ROMPATCH_PATCH_PATCH(x)            (((uint32_t)(((uint32_t)(x)) << FLASH_ROMPATCH_PATCH_PATCH_SHIFT)) & FLASH_ROMPATCH_PATCH_PATCH_MASK)
/*! @} */

/* The count of FLASH_ROMPATCH_PATCH */
#define FLASH_ROMPATCH_PATCH_COUNT               (255U)


/*!
 * @}
 */ /* end of group FLASH_ROMPATCH_Register_Masks */


/* FLASH_ROMPATCH - Peripheral instance base addresses */
#if (defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE & 0x2))
  /** Peripheral FLASH_ROMPATCH base address */
  #define FLASH_ROMPATCH_BASE                      (0x1003EC00u)
  /** Peripheral FLASH_ROMPATCH base address */
  #define FLASH_ROMPATCH_BASE_NS                   (0x3EC00u)
  /** Peripheral FLASH_ROMPATCH base pointer */
  #define FLASH_ROMPATCH                           ((FLASH_ROMPATCH_Type *)FLASH_ROMPATCH_BASE)
  /** Peripheral FLASH_ROMPATCH base pointer */
  #define FLASH_ROMPATCH_NS                        ((FLASH_ROMPATCH_Type *)FLASH_ROMPATCH_BASE_NS)
  /** Array initializer of FLASH_ROMPATCH peripheral base addresses */
  #define FLASH_ROMPATCH_BASE_ADDRS                { FLASH_ROMPATCH_BASE }
  /** Array initializer of FLASH_ROMPATCH peripheral base pointers */
  #define FLASH_ROMPATCH_BASE_PTRS                 { FLASH_ROMPATCH }
  /** Array initializer of FLASH_ROMPATCH peripheral base addresses */
  #define FLASH_ROMPATCH_BASE_ADDRS_NS             { FLASH_ROMPATCH_BASE_NS }
  /** Array initializer of FLASH_ROMPATCH peripheral base pointers */
  #define FLASH_ROMPATCH_BASE_PTRS_NS              { FLASH_ROMPATCH_NS }
#else
  /** Peripheral FLASH_ROMPATCH base address */
  #define FLASH_ROMPATCH_BASE                      (0x3EC00u)
  /** Peripheral FLASH_ROMPATCH base pointer */
  #define FLASH_ROMPATCH                           ((FLASH_ROMPATCH_Type *)FLASH_ROMPATCH_BASE)
  /** Array initializer of FLASH_ROMPATCH peripheral base addresses */
  #define FLASH_ROMPATCH_BASE_ADDRS                { FLASH_ROMPATCH_BASE }
  /** Array initializer of FLASH_ROMPATCH peripheral base pointers */
  #define FLASH_ROMPATCH_BASE_PTRS                 { FLASH_ROMPATCH }
#endif

/*!
 * @}
 */ /* end of group FLASH_ROMPATCH_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- FLEXCOMM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXCOMM_Peripheral_Access_Layer FLEXCOMM Peripheral Access Layer
 * @{
 */

/** FLEXCOMM - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[4088];
  __IO uint32_t PSELID;                            /**< Peripheral Select and Flexcomm ID register., offset: 0xFF8 */
  __I  uint32_t PID;                               /**< Peripheral identification register., offset: 0xFFC */
} FLEXCOMM_Type;

/* ----------------------------------------------------------------------------
   -- FLEXCOMM Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FLEXCOMM_Register_Masks FLEXCOMM Register Masks
 * @{
 */

