nxp-mcuxpresso/mcux-sdk/devices/LPC55S14/LPC55S14.h
#define PUF_KEYRESET_KEY2_MASK                   (0x30U)
#define PUF_KEYRESET_KEY2_SHIFT                  (4U)
/*! KEY2 - 10: Reset KEY2 shift register. Self clearing. Must be done before loading any new key.
 */
#define PUF_KEYRESET_KEY2(x)                     (((uint32_t)(((uint32_t)(x)) << PUF_KEYRESET_KEY2_SHIFT)) & PUF_KEYRESET_KEY2_MASK)

#define PUF_KEYRESET_KEY3_MASK                   (0xC0U)
#define PUF_KEYRESET_KEY3_SHIFT                  (6U)
/*! KEY3 - 10: Reset KEY3 shift register. Self clearing. Must be done before loading any new key.
 */
#define PUF_KEYRESET_KEY3(x)                     (((uint32_t)(((uint32_t)(x)) << PUF_KEYRESET_KEY3_SHIFT)) & PUF_KEYRESET_KEY3_MASK)
/*! @} */

/*! @name IDXBLK -  */
/*! @{ */

#define PUF_IDXBLK_IDX0_MASK                     (0x3U)
#define PUF_IDXBLK_IDX0_SHIFT                    (0U)
/*! IDX0 - Use to block PUF index 0
 */
#define PUF_IDXBLK_IDX0(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX0_SHIFT)) & PUF_IDXBLK_IDX0_MASK)

#define PUF_IDXBLK_IDX1_MASK                     (0xCU)
#define PUF_IDXBLK_IDX1_SHIFT                    (2U)
/*! IDX1 - Use to block PUF index 1
 */
#define PUF_IDXBLK_IDX1(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX1_SHIFT)) & PUF_IDXBLK_IDX1_MASK)

#define PUF_IDXBLK_IDX2_MASK                     (0x30U)
#define PUF_IDXBLK_IDX2_SHIFT                    (4U)
/*! IDX2 - Use to block PUF index 2
 */
#define PUF_IDXBLK_IDX2(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX2_SHIFT)) & PUF_IDXBLK_IDX2_MASK)

#define PUF_IDXBLK_IDX3_MASK                     (0xC0U)
#define PUF_IDXBLK_IDX3_SHIFT                    (6U)
/*! IDX3 - Use to block PUF index 3
 */
#define PUF_IDXBLK_IDX3(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX3_SHIFT)) & PUF_IDXBLK_IDX3_MASK)

#define PUF_IDXBLK_IDX4_MASK                     (0x300U)
#define PUF_IDXBLK_IDX4_SHIFT                    (8U)
/*! IDX4 - Use to block PUF index 4
 */
#define PUF_IDXBLK_IDX4(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX4_SHIFT)) & PUF_IDXBLK_IDX4_MASK)

#define PUF_IDXBLK_IDX5_MASK                     (0xC00U)
#define PUF_IDXBLK_IDX5_SHIFT                    (10U)
/*! IDX5 - Use to block PUF index 5
 */
#define PUF_IDXBLK_IDX5(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX5_SHIFT)) & PUF_IDXBLK_IDX5_MASK)

#define PUF_IDXBLK_IDX6_MASK                     (0x3000U)
#define PUF_IDXBLK_IDX6_SHIFT                    (12U)
/*! IDX6 - Use to block PUF index 6
 */
#define PUF_IDXBLK_IDX6(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX6_SHIFT)) & PUF_IDXBLK_IDX6_MASK)

#define PUF_IDXBLK_IDX7_MASK                     (0xC000U)
#define PUF_IDXBLK_IDX7_SHIFT                    (14U)
/*! IDX7 - Use to block PUF index 7
 */
#define PUF_IDXBLK_IDX7(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX7_SHIFT)) & PUF_IDXBLK_IDX7_MASK)

#define PUF_IDXBLK_IDX8_MASK                     (0x30000U)
#define PUF_IDXBLK_IDX8_SHIFT                    (16U)
/*! IDX8 - Use to block PUF index 8
 */
#define PUF_IDXBLK_IDX8(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX8_SHIFT)) & PUF_IDXBLK_IDX8_MASK)

#define PUF_IDXBLK_IDX9_MASK                     (0xC0000U)
#define PUF_IDXBLK_IDX9_SHIFT                    (18U)
/*! IDX9 - Use to block PUF index 9
 */
#define PUF_IDXBLK_IDX9(x)                       (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX9_SHIFT)) & PUF_IDXBLK_IDX9_MASK)

#define PUF_IDXBLK_IDX10_MASK                    (0x300000U)
#define PUF_IDXBLK_IDX10_SHIFT                   (20U)
/*! IDX10 - Use to block PUF index 10
 */
#define PUF_IDXBLK_IDX10(x)                      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX10_SHIFT)) & PUF_IDXBLK_IDX10_MASK)

#define PUF_IDXBLK_IDX11_MASK                    (0xC00000U)
#define PUF_IDXBLK_IDX11_SHIFT                   (22U)
/*! IDX11 - Use to block PUF index 11
 */
#define PUF_IDXBLK_IDX11(x)                      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX11_SHIFT)) & PUF_IDXBLK_IDX11_MASK)

#define PUF_IDXBLK_IDX12_MASK                    (0x3000000U)
#define PUF_IDXBLK_IDX12_SHIFT                   (24U)
/*! IDX12 - Use to block PUF index 12
 */
#define PUF_IDXBLK_IDX12(x)                      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX12_SHIFT)) & PUF_IDXBLK_IDX12_MASK)

#define PUF_IDXBLK_IDX13_MASK                    (0xC000000U)
#define PUF_IDXBLK_IDX13_SHIFT                   (26U)
/*! IDX13 - Use to block PUF index 13
 */
#define PUF_IDXBLK_IDX13(x)                      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX13_SHIFT)) & PUF_IDXBLK_IDX13_MASK)

#define PUF_IDXBLK_IDX14_MASK                    (0x30000000U)
#define PUF_IDXBLK_IDX14_SHIFT                   (28U)
/*! IDX14 - Use to block PUF index 14
 */
#define PUF_IDXBLK_IDX14(x)                      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX14_SHIFT)) & PUF_IDXBLK_IDX14_MASK)

#define PUF_IDXBLK_IDX15_MASK                    (0xC0000000U)
#define PUF_IDXBLK_IDX15_SHIFT                   (30U)
/*! IDX15 - Use to block PUF index 15
 */
#define PUF_IDXBLK_IDX15(x)                      (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_IDX15_SHIFT)) & PUF_IDXBLK_IDX15_MASK)
/*! @} */

/*! @name IDXBLK_DP -  */
/*! @{ */

#define PUF_IDXBLK_DP_IDX0_MASK                  (0x3U)
#define PUF_IDXBLK_DP_IDX0_SHIFT                 (0U)
/*! IDX0 - Use to block PUF index 0
 */
#define PUF_IDXBLK_DP_IDX0(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX0_SHIFT)) & PUF_IDXBLK_DP_IDX0_MASK)

#define PUF_IDXBLK_DP_IDX1_MASK                  (0xCU)
#define PUF_IDXBLK_DP_IDX1_SHIFT                 (2U)
/*! IDX1 - Use to block PUF index 1
 */
#define PUF_IDXBLK_DP_IDX1(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX1_SHIFT)) & PUF_IDXBLK_DP_IDX1_MASK)

#define PUF_IDXBLK_DP_IDX2_MASK                  (0x30U)
#define PUF_IDXBLK_DP_IDX2_SHIFT                 (4U)
/*! IDX2 - Use to block PUF index 2
 */
#define PUF_IDXBLK_DP_IDX2(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX2_SHIFT)) & PUF_IDXBLK_DP_IDX2_MASK)

#define PUF_IDXBLK_DP_IDX3_MASK                  (0xC0U)
#define PUF_IDXBLK_DP_IDX3_SHIFT                 (6U)
/*! IDX3 - Use to block PUF index 3
 */
#define PUF_IDXBLK_DP_IDX3(x)                    (((uint32_t)(((uint32_t)(x)) << PUF_IDXBLK_DP_IDX3_SHIFT)) & PUF_IDXBLK_DP_IDX3_MASK)

